{
	"1.13.1": {
		"id": "1.13.1",
		"date": "11/JUN/2020",
		"changes": {
			"0": "Paperwork Generators - Disabled option for the upcoming Metro Deployment Log Generator.",
			"1": "Street Guide - Renamed the 'Mission Row Police Station' to 'Mission Row Community Police Station'. (Credit: Flash/McClaren)"
		}
	},
	"1.13.0": {
		"id": "1.13.0",
		"date": "11/JUN/2020",
		"changes": {
			"0": "Site - Dark mode is now the default option, if cookies are cleared or never set. (Credit: Coakley, for forcing me to make this change)",
			"1": "Paperwork Generators - Front End Code Complete Rework, All generators have been updated to be using the new code.",
			"2": "Site - Small Backend code fixes.",
			"3": "Sidebar - The clock now displays a leading '0' for the hours. After: 01:00, before: 1:00"
		}
	},
	"1.12.0": {
		"id": "1.12.0",
		"date": "05/JUN/2020",
		"changes": {
			"0": "Arrest Charges Calculator - Extensive backend code rework and update, the code is much more versatile and dynamic for limitless input variations.<br><img width='100%' src='https://i.imgur.com/ZyqNTPz.png'/>",
			"1": "Arrest Charges Calculator - Sentencing Enhancements input are now applicable to charges to promote its usage, reducing both the sentence times and arrest points. (Reductions: Offender 0%, Accomplice 0%, Accessory 50%, Conspiracy 75%)<br><img width='auto' src='https://i.imgur.com/S8O62Sy.png'/>",
			"2": "Arrest Charges Calculator - Arrest Charges now dynamically display which offences (1st, 2nd, 3rd) may be applied to the selected crime.<br><img width='auto' src='https://i.imgur.com/E2Uf6xz.png'/><img width='auto' src='https://i.imgur.com/9f4mR0R.png'/>",
			"3": "Arrest Charges Calculator - Crime time calculation rework, now works with the most optimal time-based units splitting. (If time totals are 60 minutes or above, change to hours and minutes instead, if 24 hours or above, change to days and hours, etc)",
			"4": "Paperwork Generators - Small rank chooser optimisations and code fixes.",
			"5": "Paperwork Generators - More backend code updates and optimisations.",
			"6": "Site - Site-wide visual updates and element fixes.",
			"7": "Site - Backend files reshuffled to appropriate locations, split actual page structure and functional code into separate files. (No more procedural coding.)",
			"8": "Street Guide - Added missing station 'Rockford Hills Community Police Station'.<br><img width='auto' src='https://i.imgur.com/JlQFfSM.png'/>",
			"9": "Street Guide - Fixed the spelling of the Twin Towers building. (Credit: Tseard)<br><img width='auto' src='https://i.imgur.com/3A5wCrz.png'/>"
		}
	},
	"1.11.1": {
		"id": "1.11.1",
		"date": "03/JUN/2020",
		"changes": {
			"0": "Site - Swapped all CDN hosted resources to local for better performance.",
			"1": "Impound Report Generator - Fixed inaccessible generator. (Credit: Chris Farmer / Disretired)",
			"2": "Charges Table - Fixed the table header 'Classification' to be 'Type' instead.",
			"3": "Charges Table - Fixed table headers to be centered with their respective centered table detail fields.",
			"4": "Changelog - Fixed style to be showing the correct style for the page background."
		}
	},
	"1.11.0": {
		"id": "1.11.0",
		"date": "03/JUN/2020",
		"changes": {
			"1": "GitHub - Removed inactive contributors.",
			"2": "GitHub - Updated logo in documentation to be using the new .svg version.",
			"3": "Site - Favicon now also updated to .svg format. <br><img width='100px' src='/images/MDC-Panel-Favicon.svg'>",
			"4": "Site - CDN Resources updated & reshuffled to fix errors caused by unloaded resources.",
			"5": "Site - Increased concurrent visitor count expiration to 1 hour from 5 minutes.",
			"6": "Site - Removed duplicate initialisation code.",
			"7": "Site - Added new site settings for greater site-wide consistency.",
			"8": "Site - Added Colcade, revamped pages with card elements now dynamically display in columns which automatically collapse dependent on size of browser window. <br><div style='width: 100%; height: 0px; position: relative; padding-bottom: 47.890%;'><iframe src='https://streamable.com/e/ox3kbe' frameborder='0' width='100%' height='100%' allowfullscreen style='width: 100%; height: 100%; position: absolute;'></iframe></div>",
			"9": "Site - Improved URL routing system with the removal of duplicate code.",
			"10": "Site - San Andreas Penal Code link updated... again.",
			"11": "Site - Further backend code reworks and improvements for better stability, security, code-readability, and performance.",
			"12": "Site - Blown off the virtual dust and removed unused files.",
			"13": "Dashboard - Added card link to the MDC.",
			"14": "Sidebar - Removed link stack animation.",
			"15": "Sidebar - Removed unused links and relocated most to Useful Resources.",
			"16": "Street Guide - Removal of unused map styles and coordinate debugger console tool. 2733 files removed.",
			"17": "Useful Resources - Page revamped with various links from sidebar.",
			"18": "Paperwork Generators - Now updated to work with the latest <a href='https://forum.gta.world/en/index.php?/topic/9421-san-andreas-penal-code-changelog/&do=findComment&comment=219657'>Penal Code</a> update (02/JAN/2020, New Point System, Classification + Types swap, Charge Updates)",
			"19": "Paperwork Generators - Now dynamically display which classes (A, B, C) may be applied to the selected crime.",
			"20": "Paperwork Generators - Updated charges .402 & .412 to automatically detect upgrades from Misdemeanour to Felony types of crimes based on user input. <br><img width='800px' src='https://i.imgur.com/LFJYIW6.png'>",
			"21": "Paperwork Generators - Table styling updated to accomodate new columns and information. (Points + Offence #)"
		}
	},
	"1.10.2": {
		"id": "1.10.2",
		"date": "29/MAY/2020",
		"changes": {
			"1": "Site - Logo has been reworked to an SVG (Scalable Vector Graphic).<br><img width='200px' src='/images/MDC-Panel.svg'>",
			"2": "Site - OpenGraph Meta tags have been updated according with the new logo."
		}
	},
	"1.10.1": {
		"id": "1.10.1",
		"date": "27/MAY/2020",
		"changes": {
			"1": "Paperwork Generators - Fixed incorrect times on paperwork generators. Credit: Spartan",
			"2": "Arrest Report Generator - Fixed arrest report generator not generating reports. Credit: Spartan"
		}
	},
	"1.10.0": {
		"id": "1.10.0",
		"date": "26/MAY/2020",
		"changes": {
			"1": "Site - Deprecated files, HTML & JS code removal/fixups.",
			"2": "Site - Added localisation of site details for better site-wide maintainability.",
			"3": "Site - Numerous security & performance patches to help improve site responsiveness and safety.",
			"4": "Site - Cookie handling improved.",
			"5": "Site - Source code has once again been cleaned up and reduced in size.",
			"6": "Site - San Andreas Penal Code links fixed, pointing to the correct thread.",
			"7": "Impound Report Generator - Fixed vehicle plate hint to display correct message."
		}
	},
	"1.9.8": {
		"id": "1.9.8",
		"date": "13/MAY/2020",
		"changes": {
			"1": "Site - Improved mobile device user-experience with appropriate scalings to content throughout the website.",
			"2": "Site - Small dark mode input field fixes.",
			"3": "Sidebar - The sidebar now collapses on mobile devices.",
			"4": "Sidebar - Updated menu item icons for LSPD, LSSD, and LSFD to their respective logos.",
			"5": "Sidebar - Removed MDC Panel LSPD thread link.",
			"6": "Footer - Updated the footer position and fixed visual bugs."
		}
	},
	"1.9.7": {
		"id": "1.9.7",
		"date": "13/MAY/2020",
		"changes": {
			"1": "Site - MDC Panel Project has been made open-source. <a href='https://github.com/xanxTV/MDC-Panel'>GitHub - MDC Panel</a>",
			"2": "Sidebar - Fixed bottom margin on toggle-able menus.",
			"3": "Site - San Andreas Penal Code references changed to just Penal Code."
		}
	},
	"1.9.6": {
		"id": "1.9.6",
		"date": "06/MAY/2020",
		"changes": {
			"1": "Site - OpenGraph details updated. (Logo and URL fixes for when linking the site in Discord to display short previews.)",
			"2": "Sidebar - The sidebar is now scrollable if content is overflown.",
			"3": "Sidebar - Current version of the MDC Panel is now displayed on the Changelog link instead of underneath the logo.",
			"4": "Traffic Report Generator - Tint level fix. (Credit: Humour for finding the bug.)",
			"5": "Impound Report Generator - Initial commit. (Credit: Skent)",
			"6": "Impound Report Generator - Form and report structure adjustments and multiple small fixes and tweaks in both back-end and visual code."
		}
	},
	"1.9.5": {
		"id": "1.9.5",
		"date": "01/MAY/2020",
		"changes": {
			"1": "Site - Backend styling code optimisation.",
			"2": "Site - Animation delay changes.",
			"3": "Site - Session variables optimisation.",
			"4": "Site - Cookie variables optimisation.",
			"5": "Parking Ticket Generator - Title icon and evidence hint fixes.",
			"6": "Paperwork Generators - Large backend update regarding processing and defaulting variables."
		}
	},
	"1.9.4": {
		"id": "1.9.4",
		"date": "01/MAY/2020",
		"changes": {
			"1": "Settings - Live visitor counter toggle option.",
			"2": "Paperwork Generators - Main page recoded to display generators dynamically.",
			"3": "Parking Ticket Generator - Initial release.",
			"4": "Traffic Division Patrol Report Generator - Updated to the new format.",
			"5": "Sidebar - Live visitor counter is now animated."
		}
	},
	"1.9.3": {
		"id": "1.9.3",
		"date": "30/APR/2020",
		"changes": {
			"1": "Site - Live visitor counter."
		}
	},
	"1.9.2": {
		"id": "1.9.2",
		"date": "30/APR/2020",
		"changes": {
			"1": "Site - All select inputs have been updated visually and certain menus also now support search boxes.",
			"2": "Paperwork Generators - Further backend code improvements to select menus."
		}
	},
	"1.9.1": {
		"id": "1.9.1",
		"date": "28/APR/2020",
		"changes": {
			"1": "Site - All form fill out pages are now secured with alert messages to prevent accidental tab closure.",
			"2": "Site - Fixed highlighting text whilst using Day Mode.",
			"3": "Site - Fixed Clock & Breadcrumb animations to be more consistent."
		}
	},
	"1.9.0": {
		"id": "1.9.0",
		"date": "27/APR/2020",
		"changes": {
			"1": "Site - Updated MDC Panel Logo.",
			"2": "Site - Added a Favicon.",
			"3": "Site - Site-wide visual overhaul.",
			"4": "Site - Reworked entire URL Routing system for neater links.",
			"5": "Site - Breadcrumb Navigation added.",
			"6": "Site - Live Sidebar Clock added.",
			"7": "Site - Site Settings & Preferences added (Day/Night, Live Clock, Breadcrumb, Background Logo, Hints, Footer toggles & Clear Cookies.).",
			"8": "Site - Changelog system added.",
			"9": "Paperwork Generators - Reworked from the ground-up for code efficiency, error checking, variable defaulting, clutter reduction, and optimisation for upcoming projects.",
			"10": "Arrest Report Generators - Reworked entire backend code regarding the arrest charges table. The table will now display on the generated arrest report page.",
			"11": "Arrest & Traffic Report Generators - If the dashboard camera section is left empty, it will default to the following message instead No dashboard camera video or audio footage attached.",
			"12": "Traffic Report Generator - Updated to be using the same JSON Penal Code file as the Arrest Report Generator.",
			"13": "Traffic Division: Patrol Report Generator - Added tips and hints for input fields for clarity."
		}
	},
	"1.8.5": {
		"id": "1.8.5",
		"date": "19/APR/2020",
		"changes": {
			"1": "Arrest Report Generator - All charges now read from one single JSON file instead of two separate files for data extraction when calculating charges and for selectable choices from a list.",
			"2": "Charges - Fixed charge 116 showing the incorrect charge title."
		}
	},
	"1.8.4": {
		"id": "1.8.4",
		"date": "06/MAR/2020",
		"changes": {
			"1": "Penal Code - Updated all charges to the newest penal code update.",
			"2": "Arrest Report Generator - Improved code.",
			"3": "Arrest Charges Form - Fixed numerous icon spacing issues & removal of deprecated tooltip code.",
			"4": "Arrest Charges Table - Added Court section to table."
		}
	},
	"1.8.3": {
		"id": "1.8.3",
		"date": "05/MAR/2020",
		"changes": {
			"1": "Site - Error tracker fixed.",
			"2": "Charges - Fixed times for charge 120. depending on offence count."
		}
	},
	"1.8.2": {
		"id": "1.8.2",
		"date": "28/FEB/2020",
		"changes": {
			"1": "Patrol Log Generator - Initial release.",
			"2": "Street Guide - Added the LSPD Impound Lot to the map.",
			"3": "Street Guide - Changed icon for the Twin-Tower Correctional Facility."
		}
	},
	"1.8.1": {
		"id": "1.8.1",
		"date": "23/FEB/2020",
		"changes": {
			"1": "Site - Renamed MDC Paperwork Generators to MDC Panel.",
			"2": "Site - Panel icons now light up when hovering your mouse over them.",
			"3": "Site - Mobile adjustments for better device scalability.",
			"4": "Dashboard - Added a main dashboard hub for all the MDC Panel's features.",
			"5": "Sidebar - Renamed numerous amounts of links and added the following: Dashboard, LSSD, LSFD, MDC Panel - Thread."
		}
	},
	"1.8.0": {
		"id": "1.8.0",
		"date": "22/FEB/2020",
		"changes": {
			"1": "Street Guide - Initial Release.",
			"2": "Arrest Report Generator - Initial Release",
			"3": "Sidebar - Initial Release.",
			"4": "Navigation Bar - Removed.",
			"5": "Generators - Rearranged the generator panels.",
			"6": "Added Legion Square to the District list."
		}
	},
	"1.7.0": {
		"id": "1.7.0",
		"date": "14/FEB/2020",
		"changes": {
			"1": "Site - Logo for the MDC has been updated.",
			"2": "Site - The background of the site has changed from the LSPD logo to the San Andreas Seal.",
			"3": "Traffic Division Patrol Report Generator - Initial release.",
			"4": "Traffic Report Generator - Fixed the text colouring issues when copying reports and using Dark/Day mode on the actual MDC."
		}
	},
	"1.6.1": {
		"id": "1.6.1",
		"date": "22/JAN/2020",
		"changes": {
			"1": "Site - Added LSSD ranks.",
			"2": "Site - Added many missing vehicles from the automatic completion dropdown.",
			"3": "Added Vehicles - Albany Virgo Classic, Albany V-STR, Annis Kawaii, Benefactor Streiter (Sedan), Benefactor Streiter (SUV), Dinka Blista Kanjo, Dinka Flash, Dinka Sugoi, Karin Everon, Karin Sultan Classic, Lampadati Komoda, Maxwell Asbo, Maxwell Vagrant, Vapid Dominator Classic, Vapid Retinue MK II, Vapid Scout, Vapid Torrence, Överflöd Imorgon, Übermacht Rebla GTS.",
			"4": "Traffic Report - Added level 5 tint option.",
			"5": "Traffic Report - Fixed a spelling mistake."
		}
	},
	"1.6.0": {
		"id": "1.6.0",
		"date": "22/JAN/2020",
		"changes": {
			"1": "Evidence Registration Log - Initial release (old format).",
			"2": "Site - Background opacity fixed across browsers.",
			"3": "Site - Fixed San Andreas Penal Code related links.",
			"4": "Resources - Added a new submenu Resources. Contains quick resources.",
			"5": "Traffic Report - Fixed copy and paste code for the generator for new MDC.",
			"6": "Traffic Report - Fixed Create Record link for new MDC."
		}
	},
	"1.5.0": {
		"id": "1.5.0",
		"date": "11/DEC/2019",
		"changes": {
			"1": "Evidence Registration Log Generator - Initial release, left disabled until further notice.",
			"2": "Death Report Generator - now automatically adds N/A for accepted empty input fields once submitted.",
			"3": "Death Report Generator - Improved the evidence processing code.",
			"4": "Paperwork Generators - Added icons to the main generator picker page.",
			"5": "Paperwork Generators - Updated the colour scheme.",
			"6": "Navigation Bar - Sorted out the order of the navigation links.",
			"7": "Navigation Bar - Added a Reports and Records Board link under the Los Santos Police Department navigation menu option.",
			"8": "Navigation Bar - Spaced out the navigation bar title and logo."
		}
	},
	"1.4.1": {
		"id": "1.4.1",
		"date": "11/DEC/2019",
		"changes": {
			"1": "Site - Added META tags for previewing purposes such as when posting Discord links.",
			"2": "Site - Added an N/A, Forensic Analyst, and Crime Scene Investigator ranks to the rank chooser.",
			"3": "Navigation Bar - Fixed a bug where the results page navigation bar would not work correctly when clicking on menus."
		}
	},
	"1.4.0": {
		"id": "1.4.0",
		"date": "11/DEC/2019",
		"changes": {
			"1": "Site - Website branding and name change to MDC.",
			"2": "Site - Website has been adjusted and accommodated for future projects and generators.",
			"3": "Site - Temporary switch to lightmode until a toggle is created.",
			"4": "Death Report Generator - Initial release.",
			"5": "Paperwork Generators - Added prepending icons to many input fields for form fill outs.",
			"6": "Paperwork Generators - Addition of tooltips on hover or on focus to replace small help texts to remove visible clutter.",
			"7": "Paperwork Generators - Fixed a bug where the rank chooser would remember the user's rank for each added slot."
		}
	},
	"1.3.0": {
		"id": "1.3.0",
		"date": "27/NOV/2019",
		"changes": {
			"1": "Navigation Bar - Useful links and resources.",
			"2": "Paperwork Generators - Make & Model section swapped from text input to autocomplete text input.",
			"3": "Paperwork Generators - Street Name section swapped from text input to autocomplete text input.",
			"4": "Paperwork Generators - District section swapped from text input to autocomplete text input.",
			"5": "Paperwork Generators - Section Streetname has been renamed to Street Name."
		}
	},
	"1.2.0": {
		"id": "1.2.0",
		"date": "26/NOV/2019",
		"changes": {
			"1": "Traffic Report Generator - Automatic crime classification detection and colouring.",
			"2": "Traffic Report Generator - Fine section is now optional as not all crimes have fines attached to them.",
			"3": "Traffic Report Generator - Crime ID, Title, & Classification section swapped from text input to list input.",
			"4": "Traffic Report Generator - Crime Classification section was removed.",
			"5": "Traffic Report Generator - Drivers License section swapped from radio input to list input.",
			"6": "Traffic Report Generator - Tint Level section swapped from number input to list input.",
			"7": "Traffic Report Generator - Certain section titles were renamed. (Tints -> Tint Level, Neighbourhood -> District, Defendant Details, Narrative, & Dashboard Camera -> Defendant & Narrative, Crime ID & Title -> Crime ID, Title, & Classification)",
			"8": "Traffic Report Generator - Certain help messages were edited and refined."
		}
	},
	"1.1.0": {
		"id": "1.1.0",
		"date": "23/NOV/2019",
		"changes": {
			"1": "Site - Website now supports HTTPS SSL/TLS encryption.",
			"2": "Site - Dark mode has been activated.",
			"3": "Site - Small visual details have been adjusted.",
			"4": "Generated Report - Added Create Record: Defendant Name button.",
			"5": "Traffic Report Generator - Input fields now highlight when in use.",
			"6": "Traffic Report Generator - Added Dashboard Camera section.",
			"7": "Traffic Report Generator - Added Defendant Drivers License section.",
			"8": "Traffic Report Generator - Added missing icon to the Submit button.",
			"9": "Traffic Report Generator - Removed unneeded labels for subsequent Officer Slots & Citations.",
			"10": "Traffic Report Generator - Expanded on various help messages / hints to provide more details.",
			"11": "Traffic Report Generator - Brackets () around the crime class for citations have been removed."
		}
	},
	"1.0.0": {
		"id": "1.0.0",
		"date": "22/NOV/2019",
		"changes": {
			"1": "Initial release."
		}
	}

}